## import library yang digunakan

In [33]:
import pandas as pd
from openpyxl import load_workbook

## inisisasi file excel

In [34]:
wb = load_workbook('D:\Studied_at_UNP\SEMESTER-5\praktikum_data_mining\praktikum_3\Data Alumni.xlsx')
sheet_range = wb['Sheet1']
df = pd.DataFrame(sheet_range.values)

<>:1: SyntaxWarning: invalid escape sequence '\S'
<>:1: SyntaxWarning: invalid escape sequence '\S'
C:\Users\asus\AppData\Local\Temp\ipykernel_9968\4030817579.py:1: SyntaxWarning: invalid escape sequence '\S'
  wb = load_workbook('D:\Studied_at_UNP\SEMESTER-5\praktikum_data_mining\praktikum_3\Data Alumni.xlsx')

## mengubah bentuk tabel

In [35]:
df.columns = df.iloc[0]
df = df.drop(0)
df

,No,NIM,TTL,IPK,Masa Tunggu,Tahun Masuk,Tahun Lulus,Gaji,TOEFL,Masa Studi,Umur
1,1,9018263,"Tapuih, 4 November 1989",2.13,2.4,2009,2016,2000000,390,7,34
2,2,9018269,"Koto Anau, 19 Desember 1990",2.75,2.4,2009,2016,2000000,413,7,33
3,3,9020026,"Lampung, 27 Maret 1992",3.24,2.4,2009,2016,2000000,400,7,31
4,4,12018060,"Padang, 23 Maret 1994",3.37,2.4,2012,2016,2000000,396,4,29
5,5,11018022,"Jakarta, 22 Juni 1993",3.2,2.4,2011,2016,2000000,460,5,30
6,6,9018212,"Pekanbaru, 3 Juni 1991",3.24,0,2009,2016,1200000,403,7,32
7,7,9018301,"Purbalingga, 08 Oktober 1991",3.06,2.4,2009,2016,2000000,450,7,32
8,8,12022020,"Bukittinggi, 29 Maret 1992",3.47,2.4,2012,2016,1500000,423,4,31

## transformasi data IPK

In [36]:
df['IPK'] = df['IPK'].apply(str)
df['IPK'] = df['IPK'].str.replace(',', '.').apply(float)
df

,No,NIM,TTL,IPK,Masa Tunggu,Tahun Masuk,Tahun Lulus,Gaji,TOEFL,Masa Studi,Umur
1,1,9018263,"Tapuih, 4 November 1989",2.13,2.4,2009,2016,2000000,390,7,34
2,2,9018269,"Koto Anau, 19 Desember 1990",2.75,2.4,2009,2016,2000000,413,7,33
3,3,9020026,"Lampung, 27 Maret 1992",3.24,2.4,2009,2016,2000000,400,7,31
4,4,12018060,"Padang, 23 Maret 1994",3.37,2.4,2012,2016,2000000,396,4,29
5,5,11018022,"Jakarta, 22 Juni 1993",3.20,2.4,2011,2016,2000000,460,5,30
6,6,9018212,"Pekanbaru, 3 Juni 1991",3.24,0,2009,2016,1200000,403,7,32
7,7,9018301,"Purbalingga, 08 Oktober 1991",3.06,2.4,2009,2016,2000000,450,7,32
8,8,12022020,"Bukittinggi, 29 Maret 1992",3.47,2.4,2012,2016,1500000,423,4,31

## kategori IPK

In [37]:
for index, row in df.iterrows():
    if row['IPK'] > 3.50:
        df.loc[index, 'nilai_ipk'] = 'Maksimum'
    elif row ['IPK'] >= 2.75:
        df.loc[index, 'nilai_ipk'] = 'Rata-rata'
    else:
        df.loc[index, 'nilai_ipk'] = 'Minimum'
df[['NIM', 'IPK', 'nilai_ipk']]

0       NIM   IPK  nilai_ipk
1   9018263  2.13    Minimum
2   9018269  2.75  Rata-rata
3   9020026  3.24  Rata-rata
4  12018060  3.37  Rata-rata
5  11018022  3.20  Rata-rata
6   9018212  3.24  Rata-rata
7   9018301  3.06  Rata-rata
8  12022020  3.47  Rata-rata

## kategori TOEFL

In [38]:
for index, row in df.iterrows():
    if row['TOEFL'] >= 500:
        df.loc[index, 'k_TOEFL'] = 'T3'
    elif row['TOEFL'] >= 450:
        df.loc[index, 'k_TOEFL'] = 'T2'
    else:
        df.loc[index, 'k_TOEFL'] = 'T1'
df[['NIM', 'IPK', 'TOEFL', 'k_TOEFL']]

0       NIM   IPK TOEFL k_TOEFL
1   9018263  2.13   390      T1
2   9018269  2.75   413      T1
3   9020026  3.24   400      T1
4  12018060  3.37   396      T1
5  11018022  3.20   460      T2
6   9018212  3.24   403      T1
7   9018301  3.06   450      T2
8  12022020  3.47   423      T1

## kategori waktu tunggu

In [39]:
for index, row in df.iterrows():
    if row['Masa Tunggu'] >= 9:
        df.loc[index, 'k_waktu'] = 'W4'
    elif  row['Masa Tunggu'] >= 6:
        df.loc[index, 'k_waktu'] = 'W3'
    elif row['Masa Tunggu'] >= 3:
        df.loc[index, 'k_waktu']  = 'W2'
    else:
        df.loc[index, 'k_waktu'] = 'W1'
df[['NIM', 'IPK', 'TOEFL', 'k_waktu']]

0       NIM   IPK TOEFL k_waktu
1   9018263  2.13   390      W1
2   9018269  2.75   413      W1
3   9020026  3.24   400      W1
4  12018060  3.37   396      W1
5  11018022  3.20   460      W1
6   9018212  3.24   403      W1
7   9018301  3.06   450      W1
8  12022020  3.47   423      W1

## kategori lama studi

In [40]:
for index, row in df.iterrows():
    if row['Masa Studi'] > 4:
        df.loc[index, 'lama_studi'] = 'TTW'
    else:
        df.loc[index, 'lama_studi'] = 'TW'
df[['NIM', 'IPK', 'TOEFL', 'Masa Tunggu', 'lama_studi']]

0       NIM   IPK TOEFL Masa Tunggu lama_studi
1   9018263  2.13   390         2.4        TTW
2   9018269  2.75   413         2.4        TTW
3   9020026  3.24   400         2.4        TTW
4  12018060  3.37   396         2.4         TW
5  11018022  3.20   460         2.4        TTW
6   9018212  3.24   403           0        TTW
7   9018301  3.06   450         2.4        TTW
8  12022020  3.47   423         2.4         TW

## Kategori Umur

In [41]:
for index, row in df.iterrows():
    if row['Umur'] >= 25:
        df.loc[index, 'k_umur'] = 'TP'
    else:
        df.loc[index, 'k_umur'] = 'UP'
df[['NIM', 'IPK', 'TOEFL', 'Masa Tunggu', 'lama_studi', 'k_umur']]

0       NIM   IPK TOEFL Masa Tunggu lama_studi k_umur
1   9018263  2.13   390         2.4        TTW     TP
2   9018269  2.75   413         2.4        TTW     TP
3   9020026  3.24   400         2.4        TTW     TP
4  12018060  3.37   396         2.4         TW     TP
5  11018022  3.20   460         2.4        TTW     TP
6   9018212  3.24   403           0        TTW     TP
7   9018301  3.06   450         2.4        TTW     TP
8  12022020  3.47   423         2.4         TW     TP

## Kategori Gaji

In [42]:
for index, row in df.iterrows():
    if row['Gaji'] >= 1572200:
        df.loc[index, 'k_gaji'] = 'A.UMR'
    else:
        df.loc[index, 'k_gaji'] = 'B.UMR'
df[['NIM', 'IPK', 'TOEFL', 'Masa Tunggu', 'k_umur', 'Gaji', 'k_gaji']]

0       NIM   IPK TOEFL Masa Tunggu k_umur     Gaji k_gaji
1   9018263  2.13   390         2.4     TP  2000000  A.UMR
2   9018269  2.75   413         2.4     TP  2000000  A.UMR
3   9020026  3.24   400         2.4     TP  2000000  A.UMR
4  12018060  3.37   396         2.4     TP  2000000  A.UMR
5  11018022  3.20   460         2.4     TP  2000000  A.UMR
6   9018212  3.24   403           0     TP  1200000  B.UMR
7   9018301  3.06   450         2.4     TP  2000000  A.UMR
8  12022020  3.47   423         2.4     TP  1500000  B.UMR

## transformasi data umur

In [43]:
df['Umur'] = df['Umur'].multiply(2)
df

,No,NIM,TTL,IPK,Masa Tunggu,Tahun Masuk,Tahun Lulus,Gaji,TOEFL,Masa Studi,Umur,nilai_ipk,k_TOEFL,k_waktu,lama_studi,k_umur,k_gaji
1,1,9018263,"Tapuih, 4 November 1989",2.13,2.4,2009,2016,2000000,390,7,68,Minimum,T1,W1,TTW,TP,A.UMR
2,2,9018269,"Koto Anau, 19 Desember 1990",2.75,2.4,2009,2016,2000000,413,7,66,Rata-rata,T1,W1,TTW,TP,A.UMR
3,3,9020026,"Lampung, 27 Maret 1992",3.24,2.4,2009,2016,2000000,400,7,62,Rata-rata,T1,W1,TTW,TP,A.UMR
4,4,12018060,"Padang, 23 Maret 1994",3.37,2.4,2012,2016,2000000,396,4,58,Rata-rata,T1,W1,TW,TP,A.UMR
5,5,11018022,"Jakarta, 22 Juni 1993",3.20,2.4,2011,2016,2000000,460,5,60,Rata-rata,T2,W1,TTW,TP,A.UMR
6,6,9018212,"Pekanbaru, 3 Juni 1991",3.24,0,2009,2016,1200000,403,7,64,Rata-rata,T1,W1,TTW,TP,B.UMR
7,7,9018301,"Purbalingga, 08 Oktober 1991",3.06,2.4,2009,2016,2000000,450,7,64,Rata-rata,T2,W1,TTW,TP,A.UMR
8,8,12022020,"Bukittinggi, 29 Maret 1992",3.47,2.4,2012,2016,1500000,423,4,62,Rata-rata,T1,W1,TW,TP,B.UMR